app/controllers/items_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Romano"], ["list_id", 1], ["created_at", "2018-04-01 23:32:09.126419"], ["updated_at", "2018-04-01 23:32:09.126419"]]
---
  def create
    @list = List.find(params[:list_id]) # finding the parent
    @item = @list.items.build(item_params)
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", 1], ["updated_at", "2018-04-01 23:36:48.948532"], ["id", 3]]
---
  def update
    @item = Item.find(params[:id])
    @item.update(item_params)