app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Christmas List"], ["created_at", "2018-01-01 14:41:26.118022"], ["updated_at", "2018-01-01 14:41:26.118022"]]