app/controllers/sessions_controller.rb

  def create
    if auth_hash = request.env["omniauth.auth"]

      #logged in via omniauth
     oauth_email = request.env["omniauth.auth"]["info"]["email"]
     if user = User.find_by(:email => oauth_email)
        session[:user_id] = user.id
        redirect_to root_path
      else
        user = User.new(:email => oauth_email, :password => SecureRandom.hex)
        if user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "chrisjames.r@gmail.com"]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)