app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "Chris@g.com"], ["created_at", "2018-01-01 15:04:33.963162"], ["updated_at", "2018-01-01 15:04:33.963162"]]
---
  def create

    user = User.new(user_params)

    if user.save